app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bradox oduor"], ["description", "A boy who had a dream to achieve much more in life"], ["created_at", "2023-07-07 09:41:02.755520"], ["updated_at", "2023-07-07 09:41:02.755520"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Bradox Oduor P4L"], ["updated_at", "2023-07-07 10:49:23.796357"], ["id", 1]]